create_supply_net VDD
create_supply_net VSS


create_power_domain PD_spimemio -include_scope
set_domain_supply_net PD_spimemio -primary_power_net VDD -primary_ground_net VSS

create_supply_port VDD -domain PD_spimemio -direction in
create_supply_port VSS -domain PD_spimemio -direction in

connect_supply_net VDD -ports VDD
connect_supply_net VSS -ports VSS

